ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "arm_mve.h"
#include "stdio.h"
#include <stdint.h>
#include <string.h>
#include "xspi_nor.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "mx25um51245g.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define HPIX 640
#define VPIX 480
#define N (HPIX * VPIX)

#define LED1_SET()    (GPIOG->BSRR = LED1_Pin)
#define LED1_RESET()  (GPIOG->BSRR = (LED1_Pin << 16))
#define LED1_Pin GPIO_PIN_8
#define LED1_GPIO_Port GPIOG

#define CYCLES_TO_MS(cycles) ((cycles) / 600000)
#define CYCLES_TO_US(cycles) ((cycles) / 600)

#define XSPI1_MMAP_BASE   0x90000000UL
#define XSPI2_MMAP_BASE   0x70000000UL
#define XSPI_MMAP_SIZE    0x10000000UL  // 256 MB

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

UART_HandleTypeDef huart1;

XSPI_HandleTypeDef hxspi2;

/* USER CODE BEGIN PV */
__attribute__((aligned(16), section(".axisram1"))) uint16_t src_u16[N];
__attribute__((aligned(16), section(".axisram1"))) uint16_t planck_table[65536];

__attribute__((aligned(16))) uint16_t gain_u16[N];
__attribute__((aligned(16))) uint16_t dst_u16[N];
__attribute__((aligned(16))) uint16_t off_u16[N];
__attribute__((aligned(16))) uint16_t temp_u16[N];
uint8_t aTxBuffer[BUFFERSIZE];

/* Buffer used for reception */
__IO uint8_t aRxBuffer[BUFFERSIZE];

uint32_t xspi_mmap_base = XSPI2_MMAP_BASE;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_XSPI2_Init(void);
/* USER CODE BEGIN PFP */

static inline uint16_t gain_to_q15(float gain);
void process_mve(const uint16_t *src, const uint16_t *gain, uint16_t *dst, int n, int16_t offset);
void planck_lut_mve(const uint16_t *src, uint16_t *dst, int n);
static void XSPI_WriteEnable(XSPI_HandleTypeDef *hxspi);
static void XSPI_AutoPollingMemReady(XSPI_HandleTypeDef *hxspi);
static void XSPI_NOR_OctalDTRModeCfg(XSPI_HandleTypeDef *hxspi);

/* Debug / Helper prototypes (kept inside USER CODE blocks) */
void XSPI_PerformanceTest(void);
void test_memory_mapped_detailed(void);
void check_xspi_clock(void);
void xspi_quick_status(void);
void xspi_print_all_registers(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

#if !defined(TERMINAL_IO)
#if defined(__ICCARM__)
int iar_fputc(int ch);
#define PUTCHAR_PROTOTYPE int iar_fputc(int ch)
#elif defined ( __CC_ARM ) || defined(__ARMCC_VERSION)
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#elif defined(__GNUC__)
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#endif
#endif

void XSPI_PerformanceTest(void)
{
    // Nutze temp_u16 als Test-Buffer (ist schon im RAM!)
    uint8_t *test_tx = (uint8_t*)temp_u16;
    uint8_t *test_rx = (uint8_t*)dst_u16;

    printf("\n================================================\n");
    printf("  XSPI NOR FLASH PERFORMANCE TESTS\n");
    printf("================================================\n\n");

    XSPI_RegularCmdTypeDef sCommand = {0};
    uint32_t cycles_start, cycles_end, cycles_elapsed;
    uint32_t test_sizes[] = {256, 512, 1024, 4096};
    uint32_t test_addresses[] = {0x0000, 0x1000, 0x2000, 0x3000};
    int test_idx;

    printf("Clock: 600 MHz\n");
    printf("Buffer: Reusing temp_u16/dst_u16\n");
    printf("Mode: OPI DTR (8-line DDR)\n\n");

    /* ==================== TEST 1: WRITE ==================== */
    printf("TEST 1: Write Performance\n");
    printf("-------------------------\n");

    for (test_idx = 0; test_idx < 4; test_idx++) {
        printf("[DEBUG] Test %d starting...\n", test_idx);

        uint32_t size = test_sizes[test_idx];
        uint32_t addr = test_addresses[test_idx];

        printf("[DEBUG] Preparing %u bytes...\n", size);
        for (uint32_t i = 0; i < size; i++) {
            test_tx[i] = (uint8_t)(i & 0xFF);
        }

        printf("[DEBUG] Write Enable...\n");
        XSPI_WriteEnable(&hxspi2);

        printf("[DEBUG] Erasing sector @ 0x%04X...\n", addr);
        sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
        sCommand.Instruction        = OCTAL_SECTOR_ERASE_CMD;
        sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
        sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
        sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
        sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
        sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
        sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
        sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
        sCommand.DataMode           = HAL_XSPI_DATA_NONE;
        sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
        sCommand.Address            = addr;
        sCommand.DummyCycles        = 0;
        sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;

        if (HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
            printf("[ERROR] Erase command failed!\n");
            return;
        }

        printf("[DEBUG] Waiting for erase...\n");
        XSPI_AutoPollingMemReady(&hxspi2);

