ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
    const uint32x4_t rnd = vdupq_n_u32(1u << (shift - 1));
    const int32x4_t off32 = vdupq_n_s32(offset);
    const int32x4_t zeroS = vdupq_n_s32(0);
    const int32x4_t negSh = vdupq_n_s32(-15);

    for (; i <= n - step; i += step)
    {
        uint16x8_t s16 = vld1q_u16(src + i);
        uint16x8_t g16 = vld1q_u16(gain + i);

        uint32x4_t lo32 = vmullbq_int_u16(s16, g16);
        uint32x4_t hi32 = vmulltq_int_u16(s16, g16);

        lo32 = vaddq_u32(lo32, rnd);
        hi32 = vaddq_u32(hi32, rnd);

        lo32 = vshlq_u32(lo32, negSh);
        hi32 = vshlq_u32(hi32, negSh);

        int32x4_t loS = vqaddq_s32(vreinterpretq_s32_u32(lo32), off32);
        int32x4_t hiS = vqaddq_s32(vreinterpretq_s32_u32(hi32), off32);

        loS = vmaxq_s32(loS, zeroS);
        hiS = vmaxq_s32(hiS, zeroS);

        uint32x4_t loU = vreinterpretq_u32_s32(loS);
        uint32x4_t hiU = vreinterpretq_u32_s32(hiS);

        uint16x8_t out = vdupq_n_u16(0);
        out = vqmovnbq_u32(out, loU);
        out = vqmovntq_u32(out, hiU);

        vst1q_u16(dst + i, out);
    }

    for (; i < n; ++i) {
        uint32_t prod = (uint32_t)src[i] * (uint32_t)gain[i];
        uint32_t rounded = prod + (1u << (shift - 1));
        uint32_t shifted = rounded >> shift;
        int32_t result = (int32_t)shifted + (int32_t)offset;

        if (result < 0) result = 0;
        if (result > 65535) result = 65535;

        dst[i] = (uint16_t)result;
    }
}

void planck_lut_mve(const uint16_t *src, uint16_t *dst, int n)
{
    int i = 0;
    for (; i <= n - 8; i += 8)
    {
        uint16x8_t idx = vld1q_u16(src + i);
        uint16x8_t val = vldrhq_gather_shifted_offset_u16(planck_table, idx);
        vst1q_u16(dst + i, val);
    }
    for (; i < n; ++i) dst[i] = planck_table[src[i]];
}

/* USER CODE BEGIN 4 */

void xspi_memory_mapped_speed_test(void) {
    printf("\n");
    printf("╔════════════════════════════════════════════════╗\n");
    printf("║ XSPI Memory-Mapped Performance Test           ║\n");
    printf("╚════════════════════════════════════════════════╝\n");

    volatile uint8_t *flash_base = (uint8_t*)xspi_mmap_base;
    uint32_t test_sizes[] = {256, 1024, 4096, 16384, 65536};  // ← Reduced!
    const int num_tests = 5;

    printf("\nSequential Read Performance:\n");
    printf("Size      | Cycles    | Time (us) | Speed (MB/s)\n");
    printf("----------|-----------|-----------|-------------\n");

    for (int t = 0; t < num_tests; t++) {
        uint32_t size = test_sizes[t];
        volatile uint32_t dummy = 0;

        // Warmup (prime cache)
        for (uint32_t i = 0; i < size; i += 4) {
            dummy += flash_base[i];
        }

        // Actual measurement
        __DSB();
        __ISB();

        uint32_t start = DWT->CYCCNT;

        // Read test - byte-wise
        for (uint32_t i = 0; i < size; i++) {
            dummy += flash_base[i];
        }

        __DSB();
        __ISB();
        uint32_t cycles = DWT->CYCCNT - start;

        uint32_t us = cycles / 600;
        uint32_t mbps = (uint64_t)size * 600000000ULL / cycles / 1048576ULL;

        printf("%7lu B | %9lu | %9lu | %11lu\n",
               size, cycles, us, mbps);

        // Prevent optimization
        if (dummy == 0xFFFFFFFF) printf(".");
    }

    printf("\n32-bit Word Read Performance:\n");
    printf("Size      | Cycles    | Time (us) | Speed (MB/s)\n");
    printf("----------|-----------|-----------|-------------\n");

    for (int t = 0; t < num_tests; t++) {
        uint32_t size = test_sizes[t];
        if (size < 4) continue;

        volatile uint32_t *flash_32 = (uint32_t*)xspi_mmap_base;
        uint32_t words = size / 4;
        volatile uint32_t dummy = 0;

        // Warmup
        for (uint32_t i = 0; i < words; i++) {
            dummy += flash_32[i];
        }

        __DSB();
        __ISB();

        uint32_t start = DWT->CYCCNT;

        // Read test - word-wise
        for (uint32_t i = 0; i < words; i++) {
            dummy += flash_32[i];
        }

        __DSB();
        __ISB();
        uint32_t cycles = DWT->CYCCNT - start;

        uint32_t us = cycles / 600;
        uint32_t mbps = (uint64_t)size * 600000000ULL / cycles / 1048576ULL;

        printf("%7lu B | %9lu | %9lu | %11lu\n",
               size, cycles, us, mbps);

        if (dummy == 0xFFFFFFFF) printf(".");
    }

    printf("\nCache Effect Test (repeated reads):\n");
    printf("Pass | Cycles    | Time (us) | Speed (MB/s)\n");
    printf("-----|-----------|-----------|-------------\n");

    const uint32_t test_size = 16384;  // ← Reduced to 16 KB
    volatile uint32_t *flash_32 = (uint32_t*)xspi_mmap_base;
    uint32_t words = test_size / 4;

    for (int pass = 0; pass < 5; pass++) {
        volatile uint32_t dummy = 0;

        __DSB();
        __ISB();

        uint32_t start = DWT->CYCCNT;

        for (uint32_t i = 0; i < words; i++) {
            dummy += flash_32[i];
        }

        __DSB();
        __ISB();
        uint32_t cycles = DWT->CYCCNT - start;

        uint32_t us = cycles / 600;
        uint32_t mbps = (uint64_t)test_size * 600000000ULL / cycles / 1048576ULL;

        printf("  %d  | %9lu | %9lu | %11lu\n",
               pass + 1, cycles, us, mbps);

        if (dummy == 0xFFFFFFFF) printf(".");
    }

    printf("\nRandom Access Pattern Test:\n");
    printf("Accesses | Cycles    | Time (us) | Avg cycles/access\n");
    printf("---------|-----------|-----------|------------------\n");

    uint32_t access_counts[] = {100, 1000, 10000};

    for (int t = 0; t < 3; t++) {
        uint32_t accesses = access_counts[t];
        volatile uint32_t dummy = 0;

        __DSB();
        __ISB();

        uint32_t start = DWT->CYCCNT;

        // Pseudo-random access pattern (within 64KB to avoid huge range)
        uint32_t idx = 0;
        for (uint32_t i = 0; i < accesses; i++) {
            idx = (idx * 1103515245 + 12345) & 0xFFFF;  // 0-65535 range
            dummy += flash_base[idx];
        }

        __DSB();
        __ISB();
        uint32_t cycles = DWT->CYCCNT - start;

        uint32_t us = cycles / 600;
        uint32_t cycles_per_access = cycles / accesses;

        printf("%8lu | %9lu | %9lu | %16lu\n",
               accesses, cycles, us, cycles_per_access);

