ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
        if (dummy == 0xFFFFFFFF) printf(".");
    }

    printf("\nBurst Read Test (using existing buffers):\n");
    printf("Size      | Cycles    | Time (us) | Speed (MB/s)\n");
    printf("----------|-----------|-----------|-------------\n");

    // Use temp_u16 buffer that's already allocated
    uint8_t *target = (uint8_t*)temp_u16;  // Reuse existing buffer!
    uint32_t max_size = sizeof(temp_u16);  // 640*480*2 = 614KB

    uint32_t burst_sizes[] = {1024, 4096, 16384, 65536};

    for (int t = 0; t < 4; t++) {
        uint32_t size = burst_sizes[t];
        if (size > max_size) continue;

        __DSB();
        __ISB();

        uint32_t start = DWT->CYCCNT;

        // Actual memcpy
        for (uint32_t i = 0; i < size; i++) {
            target[i] = flash_base[i];
        }

        __DSB();
        __ISB();
        uint32_t cycles = DWT->CYCCNT - start;

        uint32_t us = cycles / 600;
        uint32_t mbps = (uint64_t)size * 600000000ULL / cycles / 1048576ULL;

        printf("%7lu B | %9lu | %9lu | %11lu\n",
               size, cycles, us, mbps);
    }

    printf("\nCalibration Data Load Simulation:\n");
    printf("Simulating 640x480 camera calibration load from XSPI...\n");

    // Simulate loading one line of calibration (interleaved)
    // 640 pixels × 4 values (dark, gain, offset, emis) × 2 bytes = 5120 bytes/line
    const uint32_t line_size = 640 * 4 * 2;
    const uint32_t lines = 480;

    printf("\nPer-line load (5120 bytes):\n");

    uint32_t total_cycles = 0;
    for (int line = 0; line < 10; line++) {  // Test 10 lines
        uint32_t offset = line * line_size;
        volatile uint32_t dummy = 0;

        __DSB();
        __ISB();
        uint32_t start = DWT->CYCCNT;

        // Load one line of calibration
        for (uint32_t i = 0; i < line_size; i += 4) {
            dummy += flash_base[offset + i];
        }

        __DSB();
        __ISB();
        uint32_t cycles = DWT->CYCCNT - start;
        total_cycles += cycles;

        if (dummy == 0xFFFFFFFF) printf(".");
    }

    uint32_t avg_cycles = total_cycles / 10;
    uint32_t avg_us = avg_cycles / 600;
    uint32_t mbps = (uint64_t)line_size * 600000000ULL / avg_cycles / 1048576ULL;

    printf("  Avg per line: %lu cycles (%lu us) = %lu MB/s\n",
           avg_cycles, avg_us, mbps);

    uint32_t total_frame_cycles = avg_cycles * lines;
    uint32_t total_frame_ms = total_frame_cycles / 600000;

    printf("  Full frame (480 lines): %lu cycles (%lu ms)\n",
           total_frame_cycles, total_frame_ms);
    printf("  Theoretical max FPS if only loading: %lu\n",
           600000000 / total_frame_cycles);

    printf("\n");
    printf("╔════════════════════════════════════════════════╗\n");
    printf("║ Memory-Mapped Speed Test Complete!            ║\n");
    printf("╚════════════════════════════════════════════════╝\n");
}
/* USER CODE END 4 */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
	XSPI_RegularCmdTypeDef sCommand = {0};
  /* USER CODE END 1 */

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_XSPI2_Init();
  /* USER CODE BEGIN 2 */
  printf("XSPI Debug startet...\r\n");

  /* Initialize buffers */
  for (int i = 0; i < BUFFERSIZE; i++) {
      aTxBuffer[i] = i;
      aRxBuffer[i] = 0;
  }

  /* Switch to OPI DTR Mode */
  XSPI_NOR_OctalDTRModeCfg(&hxspi2);

  /* Optional: Basic Write/Read Test (erase/write/read via commands) */
  XSPI_WriteEnable(&hxspi2);

  /* Performance Test */
  XSPI_PerformanceTest();

  /* ================= Memory-Mapped Mode Activation ================= */
  printf("\n╔════════════════════════════════════════════════╗\n");
  printf("║ XSPI Memory-Mapped Mode Initialization        ║\n");
  printf("╚════════════════════════════════════════════════╝\n");

  /* READ configuration (Octal IO DTR) */
  XSPI_RegularCmdTypeDef sRead = {0};
  sRead.OperationType        = HAL_XSPI_OPTYPE_READ_CFG;
  sRead.Instruction          = OCTAL_IO_DTR_READ_CMD;
  sRead.InstructionMode      = HAL_XSPI_INSTRUCTION_8_LINES;
  sRead.InstructionWidth     = HAL_XSPI_INSTRUCTION_16_BITS;
  sRead.InstructionDTRMode   = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
  sRead.AddressMode          = HAL_XSPI_ADDRESS_8_LINES;
  sRead.AddressWidth         = HAL_XSPI_ADDRESS_32_BITS;
  sRead.AddressDTRMode       = HAL_XSPI_ADDRESS_DTR_ENABLE;
  sRead.DataMode             = HAL_XSPI_DATA_8_LINES;
  sRead.DataDTRMode          = HAL_XSPI_DATA_DTR_ENABLE;
  sRead.DummyCycles          = DUMMY_CLOCK_CYCLES_READ_OCTAL;   // passend zum Flash @200MHz
  sRead.DQSMode              = HAL_XSPI_DQS_ENABLE;
  sRead.AlternateBytesMode   = HAL_XSPI_ALT_BYTES_NONE;

  if (HAL_XSPI_Command(&hxspi2, &sRead, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
      printf("✗ READ-CFG failed (err=0x%08lX)\r\n", hxspi2.ErrorCode);
      Error_Handler();
  }
  printf("✓ READ-CFG set\r\n");

  /* WRITE configuration (Page Program) — auch setzen, selbst wenn MMAP nur Lesen nutzt */
  XSPI_RegularCmdTypeDef sWrite = {0};
  sWrite.OperationType       = HAL_XSPI_OPTYPE_WRITE_CFG;
  sWrite.Instruction         = OCTAL_PAGE_PROG_CMD;
  sWrite.InstructionMode     = HAL_XSPI_INSTRUCTION_8_LINES;
  sWrite.InstructionWidth    = HAL_XSPI_INSTRUCTION_16_BITS;
  sWrite.InstructionDTRMode  = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
  sWrite.AddressMode         = HAL_XSPI_ADDRESS_8_LINES;
  sWrite.AddressWidth        = HAL_XSPI_ADDRESS_32_BITS;
  sWrite.AddressDTRMode      = HAL_XSPI_ADDRESS_DTR_ENABLE;
  sWrite.DataMode            = HAL_XSPI_DATA_8_LINES;
  sWrite.DataDTRMode         = HAL_XSPI_DATA_DTR_ENABLE;
  sWrite.DummyCycles         = 0;
  sWrite.DQSMode             = HAL_XSPI_DQS_DISABLE;
  sWrite.AlternateBytesMode  = HAL_XSPI_ALT_BYTES_NONE;

