ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
  if (HAL_XSPI_Command(&hxspi2, &sWrite, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
      printf("✗ WRITE-CFG failed (err=0x%08lX)\r\n", hxspi2.ErrorCode);
      Error_Handler();
  }
  printf("✓ WRITE-CFG set\r\n");

  /* Enter Memory-Mapped mode (mit Timeout-Zähler) */
  XSPI_MemoryMappedTypeDef sMMAP = {0};
  sMMAP.TimeOutActivation  = HAL_XSPI_TIMEOUT_COUNTER_ENABLE;
  sMMAP.TimeoutPeriodClock = 0x50; // unkritisch; bei Bedarf feiner einstellen

  if (HAL_XSPI_MemoryMapped(&hxspi2, &sMMAP) != HAL_OK) {
      printf("✗ HAL_XSPI_MemoryMapped failed (state=%d, err=0x%08lX)\r\n",
             hxspi2.State, hxspi2.ErrorCode);
      Error_Handler();
  }
  printf("✓ XSPI entered Memory-Mapped mode (state=%d)\r\n", hxspi2.State);

  xspi_mmap_base =
     (hxspi2.Instance == XSPI2) ? XSPI2_MMAP_BASE : XSPI1_MMAP_BASE;
  uint32_t xspi_mmap_end  = xspi_mmap_base + XSPI_MMAP_SIZE - 1;
  printf("MMAP base=0x%08lX..0x%08lX\r\n", (unsigned)xspi_mmap_base, (unsigned)xspi_mmap_end);


  ARM_MPU_Region_t mpu_table[] = {
    {
      .RBAR = ARM_MPU_RBAR(xspi_mmap_base, ARM_MPU_SH_NON, 0, 1, 0), // AttrIdx=0, XN=0 (exec erlaubt)
      .RLAR = ARM_MPU_RLAR(xspi_mmap_end, 0) // enable region with AttrIdx 0
    }
  };

  ARM_MPU_Disable();
  ARM_MPU_SetMemAttr(0, ARM_MPU_ATTR(
    ARM_MPU_ATTR_MEMORY_(1,0,1,0),  // Outer: WB/WA
    ARM_MPU_ATTR_MEMORY_(1,0,1,0)   // Inner: WB/WA
  ));
  ARM_MPU_Load(0, mpu_table, 1);
  ARM_MPU_Enable(MPU_CTRL_PRIVDEFENA_Msk);
  __DSB(); __ISB();
  printf("✓ MPU configured for XSPI @0x%08lX..0x%08lX\r\n", (unsigned)xspi_mmap_base, (unsigned)xspi_mmap_end);


  printf("\r\n=== Simple Memory Test (Direct) ===\r\n");
  volatile uint8_t *flash_ptr = (uint8_t*)xspi_mmap_base;
  printf("Reading first byte... ");
  uint8_t first = flash_ptr[0];
  printf("0x%02X\r\n", first);

  printf("First 16 bytes: ");
  for (int i = 0; i < 16; i++) printf("%02X ", flash_ptr[i]);
  printf("\r\n");
  printf("Simple Memory Test complete.\r\n");

  /* Clock / diagnostics */
  check_xspi_clock();
  test_memory_mapped_detailed();
  xspi_quick_status();

  printf("\n╔════════════════════════════════════════════════╗\n");
  printf("║ Memory-Mapped Mode Ready!                     ║\n");
  printf("╚════════════════════════════════════════════════╝\n");
  printf("\n");

  /* ======== Helium Benchmarks Setup ======== */
  printf("Initializing Planck LUT...\n");
  for (uint32_t i = 0; i < 65536; i++) {
      planck_table[i] = (uint16_t)i;
  }

  // Initialize test pattern
  printf("Generating test pattern...\n");
  for (uint32_t i = 0; i < N; i++) {
      uint32_t x = i % HPIX;
      src_u16[i] = (uint16_t)((x * 16383) / HPIX);
      gain_u16[i] = gain_to_q15(1.0f);
  }
  xspi_memory_mapped_speed_test();

  printf("\n╔════════════════════════════════════════════════╗\n");
  printf("║ Memory-Mapped Mode Ready!                     ║\n");
  printf("╚════════════════════════════════════════════════╝\n");
  // Benchmark
  printf("\n=== Performance Benchmark ===\n");
  __DSB();
  __ISB();
  DWT->CTRL |= 1;
  uint32_t t0 = DWT->CYCCNT;

  process_mve(src_u16, gain_u16, temp_u16, N, 0);
  uint32_t t1 = DWT->CYCCNT;

  planck_lut_mve(temp_u16, dst_u16, N);
  uint32_t t2 = DWT->CYCCNT;

  uint32_t cyc_gain = (t1 - t0);
  uint32_t cyc_planck = (t2 - t1);
  uint32_t cyc_total = (t2 - t0);

  printf("Gain/Offset: %u cycles (%u ms)\n", cyc_gain, CYCLES_TO_MS(cyc_gain));
  printf("Planck LUT:  %u cycles (%u ms)\n", cyc_planck, CYCLES_TO_MS(cyc_planck));
  printf("Total:       %u cycles (%u ms)\n", cyc_total, CYCLES_TO_MS(cyc_total));
  printf("FPS:         %u\n\n", 600000000 / cyc_total);

  // LED Test
  printf("Testing LED...\n");
  for (int i = 0; i < 3; i++) {
      LED1_SET();
      HAL_Delay(200);
      LED1_RESET();
      HAL_Delay(200);
  }
  printf("LED OK!\n\n");

  printf("Starting continuous processing...\n");
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  uint8_t led_state = 0;

  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    process_mve(src_u16, gain_u16, temp_u16, N, 0);
    planck_lut_mve(temp_u16, dst_u16, N);

    if (led_state) {
        LED1_RESET();
        led_state = 0;
    } else {
        LED1_SET();
        led_state = 1;
    }
  }
  /* USER CODE END 3 */
}
/* USER CODE BEGIN CLK 1 */
/* USER CODE END CLK 1 */

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the System Power Supply
  */
  if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK)
  {
    Error_Handler();
  }

  /* Enable HSI */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Get current CPU/System buses clocks configuration and if necessary switch
 to intermediate HSI clock to ensure target clock can be set
  */
  HAL_RCC_GetClockConfig(&RCC_ClkInitStruct);
  if ((RCC_ClkInitStruct.CPUCLKSource == RCC_CPUCLKSOURCE_IC1) ||
     (RCC_ClkInitStruct.SYSCLKSource == RCC_SYSCLKSOURCE_IC2_IC6_IC11))
  {
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_SYSCLK);
    RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_HSI;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK)
    {
      /* Initialization Error */
      Error_Handler();
    }
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL1.PLLM = 4;
  RCC_OscInitStruct.PLL1.PLLN = 75;
  RCC_OscInitStruct.PLL1.PLLFractional = 0;
  RCC_OscInitStruct.PLL1.PLLP1 = 1;
  RCC_OscInitStruct.PLL1.PLLP2 = 1;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_CPUCLK|RCC_CLOCKTYPE_HCLK
                              |RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
                              |RCC_CLOCKTYPE_PCLK2|RCC_CLOCKTYPE_PCLK5
                              |RCC_CLOCKTYPE_PCLK4;
  RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_IC1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;
  RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV1;
  RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC1Selection.ClockDivider = 2;
  RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC2Selection.ClockDivider = 3;
  RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC6Selection.ClockDivider = 4;
  RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC11Selection.ClockDivider = 3;

