ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
* @brief  This function configure the memory in Octal DTR mode.
* @param  hxspi: XSPI handle
* @retval None
*/
static void XSPI_NOR_OctalDTRModeCfg(XSPI_HandleTypeDef *hxspi)
{
  uint8_t reg = 0;
  XSPI_RegularCmdTypeDef  sCommand = {0};
  XSPI_AutoPollingTypeDef sConfig  = {0};

  sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_1_LINE;
  sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_8_BITS;
  sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
  sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_DISABLE;
  sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
  sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_DISABLE;
  sCommand.DummyCycles        = 0;
  sCommand.DQSMode            = HAL_XSPI_DQS_DISABLE;
  sConfig.MatchMode           = HAL_XSPI_MATCH_MODE_AND;
  sConfig.AutomaticStop       = HAL_XSPI_AUTOMATIC_STOP_ENABLE;
  sConfig.IntervalTime        = 0x10;

  /* Enable write operations */
  sCommand.Instruction = WRITE_ENABLE_CMD;
  sCommand.DataMode    = HAL_XSPI_DATA_NONE;
  sCommand.AddressMode = HAL_XSPI_ADDRESS_NONE;

  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  /* Reconfigure XSPI to automatic polling mode to wait for write enabling */
  sConfig.MatchMask           = 0x02;
  sConfig.MatchValue          = 0x02;

  sCommand.Instruction    = READ_STATUS_REG_CMD;
  sCommand.DataMode       = HAL_XSPI_DATA_1_LINE;
  sCommand.DataLength     = 1;

  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  /* Write Configuration register 2 (with Octal I/O SPI protocol) */
  sCommand.Instruction  = WRITE_CFG_REG_2_CMD;
  sCommand.AddressMode  = HAL_XSPI_ADDRESS_1_LINE;
  sCommand.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
  sCommand.Address      = 0;
  reg = 0x2;

  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  if (HAL_XSPI_Transmit(hxspi, &reg, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  sCommand.Instruction    = READ_STATUS_REG_CMD;
  sCommand.DataMode       = HAL_XSPI_DATA_1_LINE;
  sCommand.DataLength     = 1;

  if (HAL_XSPI_Command(hxspi, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }
}

/* === Debug helpers (protected) =========================================== */
void test_memory_mapped_detailed(void) {
    printf("\n");
    printf("╔════════════════════════════════════════╗\n");
    printf("║ Memory-Mapped Access Detailed Debug   ║\n");
    printf("╚════════════════════════════════════════╝\n");

    // [1] XSPI Handle Status
    printf("\n[1] XSPI2 HAL Handle Status:\n");
    printf("  Handle State: ");
    switch(hxspi2.State) {
        case HAL_XSPI_STATE_RESET:
            printf("RESET\n"); break;
        case HAL_XSPI_STATE_READY:
            printf("READY\n"); break;
        case HAL_XSPI_STATE_BUSY_CMD:
            printf("BUSY_CMD\n"); break;
        case HAL_XSPI_STATE_BUSY_TX:
            printf("BUSY_TX\n"); break;
        case HAL_XSPI_STATE_BUSY_RX:
            printf("BUSY_RX\n"); break;
        case HAL_XSPI_STATE_BUSY_AUTO_POLLING:
            printf("BUSY_AUTO_POLLING\n"); break;
        case HAL_XSPI_STATE_BUSY_MEM_MAPPED:
            printf("BUSY_MEM_MAPPED ✓\n"); break;
        case HAL_XSPI_STATE_ABORT:
            printf("ABORT\n"); break;
        case HAL_XSPI_STATE_ERROR:
            printf("ERROR ✗\n"); break;
        default:
            printf("UNKNOWN (%d)\n", hxspi2.State); break;
    }

    printf("  Error Code: 0x%08lX", hxspi2.ErrorCode);
    if (hxspi2.ErrorCode == HAL_XSPI_ERROR_NONE) {
        printf(" (No Error)\n");
    } else {
        printf("\n");
        if (hxspi2.ErrorCode & HAL_XSPI_ERROR_TIMEOUT)  printf("    - TIMEOUT\n");
        if (hxspi2.ErrorCode & HAL_XSPI_ERROR_TRANSFER) printf("    - TRANSFER ERROR\n");
        if (hxspi2.ErrorCode & HAL_XSPI_ERROR_DMA)      printf("    - DMA ERROR\n");
    }

    // [2] Configuration Summary
    printf("\n[2] XSPI Configuration:\n");
    printf("  Memory Type: ");
    switch(hxspi2.Init.MemoryType) {
        case HAL_XSPI_MEMTYPE_MICRON:   printf("Micron\n"); break;
        case HAL_XSPI_MEMTYPE_MACRONIX: printf("Macronix ✓\n"); break;
        case HAL_XSPI_MEMTYPE_APMEM:    printf("AP Memory\n"); break;
        default:                        printf("Unknown\n"); break;
    }

    printf("  Memory Size: %lu\n", hxspi2.Init.MemorySize);
    printf("  Clock Prescaler: %lu (÷%lu)\n",
           hxspi2.Init.ClockPrescaler,
           hxspi2.Init.ClockPrescaler + 1);
    printf("  Chip Select High Time: %lu cycles\n",
           hxspi2.Init.ChipSelectHighTimeCycle);
    printf("  Free Running Clock: %s\n",
           hxspi2.Init.FreeRunningClock == HAL_XSPI_FREERUNCLK_ENABLE ? "YES" : "NO");

    // [3] Try Memory Access
    printf("\n[3] Attempting Memory Access:\n");
    printf("  Base Address: 0x70000000\n");

    SCB->SHCSR |= SCB_SHCSR_USGFAULTENA_Msk;

    volatile uint32_t *test_addr = (uint32_t*)xspi_mmap_base;
    volatile uint32_t dummy = 0;

    printf("  Reading first word... ");
    __disable_irq();
    dummy = *test_addr;
    __enable_irq();
    printf("0x%08lX\n", dummy);

    printf("  Reading first 16 bytes:\n    ");
    for (int i = 0; i < 4; i++) {
        printf("0x%08lX ", test_addr[i]);
    }
    printf("\n");

    // [4] Data Pattern Analysis
    printf("\n[4] Data Pattern Analysis (first 256 bytes):\n");

    uint8_t all_ff = 1, all_00 = 1;
    volatile uint8_t *byte_ptr = (uint8_t*)xspi_mmap_base;
    uint32_t unique_bytes = 0;
    uint8_t byte_count[256] = {0};

