ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
    for (int i = 0; i < 256; i++) {
        uint8_t val = byte_ptr[i];
        if (val != 0xFF) all_ff = 0;
        if (val != 0x00) all_00 = 0;

        if (byte_count[val] == 0) unique_bytes++;
        byte_count[val]++;
    }

    if (all_ff) {
        printf("  Status: All 0xFF (Flash empty/erased)\n");
    } else if (all_00) {
        printf("  Status: All 0x00 (Likely read error)\n");
    } else {
        printf("  Status: Contains data pattern\n");
        printf("  Unique bytes: %lu / 256\n", unique_bytes);

        printf("  First values: ");
        int shown = 0;
        for (int i = 0; i < 32 && shown < 8; i++) {
            if (byte_ptr[i] != 0x00 && byte_ptr[i] != 0xFF) {
                printf("0x%02X ", byte_ptr[i]);
                shown++;
            }
        }
        printf("\n");
    }

    // [5] MPU Status
    printf("\n[5] MPU Status:\n");
    if (MPU->CTRL & MPU_CTRL_ENABLE_Msk) {
        printf("  MPU is ENABLED\n");
        printf("  Checking regions:\n");
        for (int region = 0; region < 8; region++) {
            MPU->RNR = region;
            uint32_t rbar = MPU->RBAR;
            uint32_t rlar = MPU->RLAR;

            if (rlar & MPU_RLAR_EN_Msk) {
                uint32_t base = rbar & 0xFFFFFFE0;
                printf("    Region %d: Base=0x%08lX ", region, base);
                if (base == xspi_mmap_base) {
                    printf("✓ (Covers XSPI)\n");
                } else {
                    printf("\n");
                }
            }
        }
    } else {
        printf("  MPU is DISABLED\n");
    }

    // [6] Cache Status
    printf("\n[6] Cache Status:\n");
    if (SCB->CCR & SCB_CCR_IC_Msk) {
        printf("  I-Cache: ENABLED\n");
    } else {
        printf("  I-Cache: DISABLED\n");
    }
    if (SCB->CCR & SCB_CCR_DC_Msk) {
        printf("  D-Cache: ENABLED\n");
    } else {
        printf("  D-Cache: DISABLED\n");
    }

    printf("\n");
    printf("╔════════════════════════════════════════╗\n");
    printf("║ Debug Analysis Complete                ║\n");
    printf("╚════════════════════════════════════════╝\n");
}

void check_xspi_clock(void) {
    printf("\n=== XSPI Clock Configuration ===\n");

    uint32_t xspi_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_XSPI2);
    uint32_t xspi_clk_mhz = xspi_clk / 1000000;
    uint32_t xspi_clk_khz = (xspi_clk / 1000) % 1000;

    printf("  XSPI2 Kernel Clock: %lu Hz (%lu.%03lu MHz)\n",
           xspi_clk, xspi_clk_mhz, xspi_clk_khz);

    if (xspi_clk < 190000000 || xspi_clk > 210000000) {
        printf("  WARNING: Clock not optimal for OPI DTR!\n");
        printf("    Current: %lu MHz\n", xspi_clk_mhz);
        printf("    Recommended: 200 MHz\n");
    } else {
        printf("  ✓ Clock in optimal range (190-210 MHz)\n");
    }

    uint32_t prescaler = hxspi2.Init.ClockPrescaler;
    printf("  Prescaler: %lu (Divider: %lu)\n", prescaler, prescaler + 1);

    uint32_t flash_clk = xspi_clk / (prescaler + 1);
    uint32_t flash_clk_mhz = flash_clk / 1000000;
    uint32_t flash_clk_khz = (flash_clk / 1000) % 1000;

    printf("  Effective Flash Clock: %lu.%03lu MHz\n",
           flash_clk_mhz, flash_clk_khz);

    uint32_t theoretical_bandwidth = (flash_clk_mhz * 16);
    printf("  Theoretical Bandwidth: %lu MB/s (OPI DTR)\n", theoretical_bandwidth);
    printf("  (Practical: ~50%% = %lu MB/s due to overhead)\n", theoretical_bandwidth / 2);
}

void xspi_quick_status(void) {
    printf("\n=== XSPI2 Quick Status ===\n");

    printf("HAL State: ");
    if (hxspi2.State == HAL_XSPI_STATE_BUSY_MEM_MAPPED) {
        printf("Memory-Mapped Mode Active ✓\n");
    } else {
        printf("NOT in Memory-Mapped Mode ✗ (State=%d)\n", hxspi2.State);
    }

    if (hxspi2.ErrorCode != HAL_XSPI_ERROR_NONE) {
        printf("ERROR: 0x%08lX\n", hxspi2.ErrorCode);
    }

    printf("\nMemory Test: ");
    volatile uint32_t *test = (uint32_t*)xspi_mmap_base;
    uint32_t val = *test;
    printf("0x%08lX", val);

    if (val == 0xFFFFFFFF) {
        printf(" (Empty Flash)\n");
    } else if (val == 0x00000000) {
        printf(" (Read Error?)\n");
    } else {
        printf(" (Has Data) ✓\n");
    }

    uint32_t clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_XSPI2);
    printf("\nClock: %lu MHz\n", clk / 1000000);
}

void xspi_print_all_registers(void) {
    printf("\n╔════════════════════════════════════════╗\n");
    printf("║ XSPI2 Register Dump                    ║\n");
    printf("╚════════════════════════════════════════╝\n");

    XSPI_TypeDef *xspi = hxspi2.Instance;

    if (xspi == NULL) {
        printf("ERROR: XSPI2 instance is NULL!\n");
        return;
    }

    printf("\nControl Registers:\n");
    printf("  CR   = 0x%08lX\n", xspi->CR);
    printf("  DCR1 = 0x%08lX\n", xspi->DCR1);
    printf("  DCR2 = 0x%08lX\n", xspi->DCR2);
    printf("  DCR3 = 0x%08lX\n", xspi->DCR3);

    printf("\nStatus:\n");
    printf("  SR   = 0x%08lX\n", xspi->SR);
    printf("  Flags: ");
    if (xspi->SR & XSPI_SR_BUSY) printf("[BUSY] ");
    if (xspi->SR & XSPI_SR_TOF)  printf("[TIMEOUT] ");
    if (xspi->SR & XSPI_SR_TEF)  printf("[ERROR] ");
    if (xspi->SR & XSPI_SR_TCF)  printf("[COMPLETE] ");
    if (xspi->SR == 0) printf("(idle)");
    printf("\n");

    printf("\nCommand Configuration:\n");
    printf("  CCR  = 0x%08lX\n", xspi->CCR);
    printf("  TCR  = 0x%08lX\n", xspi->TCR);
    printf("  IR   = 0x%08lX\n", xspi->IR);

    printf("\nDecoded Configuration:\n");
    uint32_t devsize = (xspi->DCR1 & XSPI_DCR1_DEVSIZE) >> XSPI_DCR1_DEVSIZE_Pos;
    uint32_t mem_size_mb = (1UL << (devsize + 1)) / (1024 * 1024);
    printf("  Device Size: 2^%lu = %lu MB\n", devsize + 1, mem_size_mb);

    uint32_t prescaler = (xspi->DCR2 & XSPI_DCR2_PRESCALER) >> XSPI_DCR2_PRESCALER_Pos;
    printf("  Prescaler: %lu (Divider: %lu)\n", prescaler, prescaler + 1);

    uint32_t mtyp = (xspi->DCR1 & XSPI_DCR1_MTYP) >> XSPI_DCR1_MTYP_Pos;
    printf("  Memory Type: ");
    switch(mtyp) {
        case 0: printf("Micron\n"); break;
        case 1: printf("Macronix\n"); break;
        case 2: printf("Standard\n"); break;
        case 3: printf("AP Memory\n"); break;
        default: printf("Unknown\n"); break;
    }
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
